/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : Drive_Interrupt.c
* @Description : 中断服务	
* @Date        : 2016/8/8
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@qq.com
* @Platform    : Keil uVision5 v5.20 (STM32F103RCT6)
* @Explain     : None
*=============================================================================*/

/* 头文件包含 ----------------------------------------------------------------*/
#include "Drive_Interrupt.h"

/* 私有宏定义 ----------------------------------------------------------------*/

/* 私有（静态）函数声明 ------------------------------------------------------*/

/* 全局变量定义 --------------------------------------------------------------*/
 

/* 全局函数编写 --------------------------------------------------------------*/
/**----------------------------------------------------------------------------
* @FunctionName  : TIM2_IRQHandler()
* @Description   : 定时器服务函数
* @Data          : 2016/8/8
* @Explain       : 用于时钟 
-------------------------------------------------------------------------------
None
------------------------------------------------------------------------------*/ 
void TIM2_IRQHandler(void)   
{ 
	TIM_ClearITPendingBit(TIM2,TIM_IT_Update);  //清除TIMx更新中断标志 	
	OS_Clock ++;
}



/**----------------------------------------------------------------------------
* @FunctionName  : TIM3_IRQHandler()
* @Description   : 定时器服务函数
* @Data          : 2016/8/8
* @Explain       : 用于系统线程 
-------------------------------------------------------------------------------
None
------------------------------------------------------------------------------*/ 
void TIM3_IRQHandler(void)   
{ 
	TIM_ClearITPendingBit(TIM3,TIM_IT_Update);  //清除TIMx更新中断标志 	 
	OSThread_4();
	
}


/**----------------------------------------------------------------------------
* @FunctionName  : TIM4_IRQHandler()
* @Description   : 定时器服务函数
* @Data          : 2016/8/8
* @Explain       : 用于主线程 
-------------------------------------------------------------------------------
None
------------------------------------------------------------------------------*/ 
void TIM4_IRQHandler(void)    
{ 
	TIM_ClearITPendingBit(TIM4,TIM_IT_Update);  //清除TIMx更新中断标志 	 
	OSThread_6(); 
}




/**----------------------------------------------------------------------------
* @FunctionName  : TIM5_IRQHandler()
* @Description   : 定时器服务函数
* @Data          : 2016/8/8
* @Explain       : 采集ADC
-------------------------------------------------------------------------------
None
------------------------------------------------------------------------------*/ 
void TIM5_IRQHandler(void)    
{  
	TIM_ClearITPendingBit(TIM5,TIM_IT_Update);  //清除TIMx更新中断标志 	 
	PhaseMeasure_ADC_Handle(); 
}

 
/**----------------------------------------------------------------------------
* @FunctionName  : TIM6_IRQHandler()
* @Description   : 定时器服务函数
* @Data          : 2016/8/8
* @Explain       : 测评时钟
-------------------------------------------------------------------------------
None
------------------------------------------------------------------------------*/ 
void TIM6_IRQHandler(void)    
{  
	TIM_ClearITPendingBit(TIM6,TIM_IT_Update);  //清除TIMx更新中断标志 	  
	Time_12M_Over++;  
}

/**----------------------------------------------------------------------------
* @FunctionName  : EXTI15_10_IRQHandler()
* @Description   : 外部中断服务函数
* @Data          : 2016/8/8
* @Explain       : 用于接收信息
-------------------------------------------------------------------------------
None
------------------------------------------------------------------------------*/ 
void EXTI15_10_IRQHandler(void)
{  
	if(EXTI_GetITStatus(EXTI_Line11) == SET)
	{ 
		EXTI_ClearITPendingBit(EXTI_Line11); //清除LINE11上的中断标志位  
		FreqMeasure_IRQHandler();
		
	}
	
}




/*DMA中断函数*/
void DMA1_Channel1_IRQHandler()
{	 
//	u16 i = 0,j = 0; 
	
//	if(SmallCar.Channel_Flag == 0)//转移数据
//	{
//		for(i = 0;i<CHANNEL_NUM;i++)
//			for(j = 0;j<CHANNEL_LENTH;j++)
//		{
//			SmallCar.Channel[i][j] = AD_Value[j][i]; 
//		}
//	
//		SmallCar.Channel_Flag = 1;
//	}	
	
	
	DMA_ClearITPendingBit(DMA1_IT_GL1);
}




void USART2_IRQHandler()
{ 
	if(USART_GetITStatus(USART2, USART_IT_RXNE) != RESET)  //接收中断
	{
         Message_Handle_USART2();   
    } 
	
}







/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/













