/*******************************(C) COPYRIGHT 2017 Wind(谢玉伸)*********************************/
/**============================================================================
* @FileName    : App_WindCar_Control.c
* @Description : None
* @Date        : 2017年7月10日
* @By          : Wind(谢玉伸)
* @Email       : 1659567673@qq.com
* @Platform    : Keil uVision5 v5.15 (STM32F407ZG)
* @Explain     : 风力平衡车控制
*=============================================================================*/

/* 头文件包含 ----------------------------------------------------------------*/
#include "App_WindCar_Control.h"


/* 私有宏定义 ----------------------------------------------------------------*/

/* 私有（静态）函数声明 ------------------------------------------------------*/

/* 全局变量定义 --------------------------------------------------------------*/



/* 全局变量声明 --------------------------------------------------------------*/

/* 全局函数编写 --------------------------------------------------------------*/
/**----------------------------------------------------------------------------
* @FunctionName  : WindCar_Control()
* @Description   : 风力平衡车控制
* @Data          : 2017年7月10日
* @Explain       : None
------------------------------------------------------------------------------*/
unsigned int WindCar_Control_Main(void)
{       
	PID_Control();
	
    return 0;
}	 

unsigned int WindCar_Control_Start(void)
{
	SmallCar_Init();
    return 0;
}	
Type_AppList App_WindCar_Control = {WindCar_Control_Main,NULL,WindCar_Control_Start,NULL, \
						OS_STATE_ACTIVE,OS_THREAD_SYSTEM, \
						(u8*)"WindCar_Control",3};




/*******************************(C) COPYRIGHT 2017 Wind(谢玉伸)*********************************/







