/*******************************(C) COPYRIGHT 2017 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : Drive_Key.h
* @Description : 按键
* @Date        : 2017/10/14
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.15 (STM32L151CB)
* @Explain     : None
*=============================================================================*/

/* 防止重调用 ----------------------------------------------------------------*/
#ifndef __DRIVE_KEY_H
#define __DRIVE_KEY_H

/* 头文件包含 ----------------------------------------------------------------*/
#include "User_Library.h"

/* 全局宏定义 ----------------------------------------------------------------*/  
//按键状态机相关宏定义 ----------------------------
#define	KEY_NUM						(1)			//按键数 
#define	KEY_SCAN_GAP				(20)		//按键扫描时间间隔 单位：ms

#define KEY_MODE_SHORT				(0x01 << 1)	
#define KEY_MODE_LONG				(0x01 << 2)	

#define KEY_CNT_SHORT				3			//短按 的扫描次数
#define KEY_CNT_LONG				30			//长按 的扫描次数	 

//按键定义 --------------------------------------  
#define PIN_KEY_0 					!P_In_Value(B,2) 


/* 结构体声明 ----------------------------------------------------------------*/ 
typedef struct
{  
	u8 State;		//需要手动清空   
	u8 Cnt;			//按键计数器   
	
	u8 Value;		//按键值		
	
}Type_Key;

/* 全局变量声明 --------------------------------------------------------------*/   

/* 全局函数声明 --------------------------------------------------------------*/  		 
void Key_Init(void);  
 
u8 Key_State_Get(u8 KeyNum,u8 State);   
void Key_State_Clear(u8 KeyNum);  

void Key_Scan_Handle(void);



#endif
/*******************************(C) COPYRIGHT 2017 Wind（谢玉伸）*********************************/





 









