/*******************************(C) COPYRIGHT 2017 Wind(谢玉伸)*********************************/
/**============================================================================
* @FileName    : App_FreqMeasure.c
* @Date        : 2017年7月26日
* @By          : Wind(谢玉伸)
* @Email       : 1659567673@qq.com
* @Platform    : Keil uVision5 v5.15 (STM32F407ZG)
* @Explain     : 测频率
*=============================================================================*/

/* 头文件包含 ----------------------------------------------------------------*/
#include "App_FreqMeasure.h"


/* 私有宏定义 ----------------------------------------------------------------*/

/* 私有（静态）函数声明 ------------------------------------------------------*/

/* 全局变量定义 --------------------------------------------------------------*/

/* 全局变量声明 --------------------------------------------------------------*/

/* 全局函数编写 --------------------------------------------------------------*/
/**----------------------------------------------------------------------------
* @FunctionName  : FreqMeasure()
* @Description   : 测频率
* @Data          : 2017年7月26日
* @Explain       : None
------------------------------------------------------------------------------*/
int FreqMeasure_Main(void)
{  
	OS_Num_Show(100,0,32,1,Time_168M_Over,"168M溢出计数器 [%0.0f]   ");
	OS_Num_Show(100,32,32,1,FreqMeasure_Read(),"频率:[%0.2f]Hz      ");
	OS_Num_Show(100,64,32,1,TMeasure_Read(),"周期:[%0.0f]us         ");
	
    return 0;
}	

int FreqMeasure_Start(void)
{   
	FreqMeasure_Init();
	
	
    return 0;
}	

Type_AppList App_FreqMeasure = {FreqMeasure_Main,NULL,FreqMeasure_Start,NULL, \
						OS_STATE_ACTIVE,OS_THREAD_PRIMARY, \
						(u8*)"FreqMeasure",300};












/*******************************(C) COPYRIGHT 2017 Wind(谢玉伸)*********************************/







