/*******************************(C) COPYRIGHT 2017 Wind(谢玉伸)*********************************/
/**============================================================================
* @FileName    : App_DutyMeasuring.c
* @Date        : 2017年7月17日
* @By          : Wind(谢玉伸)
* @Email       : 1659567673@qq.com
* @Platform    : Keil uVision5 v5.15 (STM32F407ZG)
* @Explain     : 测相
*=============================================================================*/

/* 头文件包含 ----------------------------------------------------------------*/
#include "App_DutyMeasuring.h"


/* 私有宏定义 ----------------------------------------------------------------*/

/* 私有（静态）函数声明 ------------------------------------------------------*/

/* 全局变量定义 --------------------------------------------------------------*/

/* 全局变量声明 --------------------------------------------------------------*/


/* 全局函数编写 --------------------------------------------------------------*/
/**----------------------------------------------------------------------------
* @FunctionName  : DutyMeasuring()
* @Description   : 测相
* @Data          : 2017年7月17日
* @Explain       : None
------------------------------------------------------------------------------*/
int DutyMeasuring_Main(void)
{     
	
	OS_Num_Show(100,50,32,1, Duty_Read(0),"占空比：[%0.5f]%%");
	
    return 0;
}	

int DutyMeasuring_Start(void)
{  
	DutyMeasuring_Init();
	
	
    return 0;
}	

Type_AppList App_DutyMeasuring = {DutyMeasuring_Main,NULL,DutyMeasuring_Start,NULL, \
						OS_STATE_ACTIVE,OS_THREAD_PRIMARY, \
						(u8*)"DutyMeasuring",100};












/*******************************(C) COPYRIGHT 2017 Wind(谢玉伸)*********************************/







