/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : App_Message.h
* @Description : FSK数通信
* @Date        : 2016/7/23
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.20 (STM32F407ZG)
* @Explain     : PF9发送    PF10接收， 采用曼彻斯特编码
*=============================================================================*/
							
/* 防止重调用 ----------------------------------------------------------------*/
#ifndef __APP_MESSAGE_H
#define __APP_MESSAGE_H 

/* 头文件包含 ----------------------------------------------------------------*/  
#include "OS_StartFile.h"

/* 全局宏定义 ----------------------------------------------------------------*/ 
#define		MESSAGE_MODE_MESSEGE		(0x01<<0)
#define		MESSAGE_MODE_AUDIO			(0x01<<1)


/* 结构体声明 ----------------------------------------------------------------*/ 
typedef struct 
{  		 
	u8 ID;
	u8 Order; 
	u8 State; 
	u8 SenDate;
	u8 Ch[MESSAGE_LENTH]; 
	u8 UpData;
	u8 Mode;
	
}Type_Message;  	
					

		

/* 全局变量声明 --------------------------------------------------------------*/ 
extern Type_Message	Message;
	

/* 全局函数声明 --------------------------------------------------------------*/  
extern Type_AppList App_Message;  


#endif
/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/



