/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : App_LED.c
* @Description : None
* @Date        : 2016/7/10
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.15 (STM32F407ZG)
* @Explain     : None
*=============================================================================*/

/* 头文件包含 ----------------------------------------------------------------*/
#include "App_LED.h"  
 
/* 私有宏定义 ----------------------------------------------------------------*/

/* 私有（静态）函数声明 ------------------------------------------------------*/

/* 全局变量定义 --------------------------------------------------------------*/
 
/* 全局变量声明 --------------------------------------------------------------*/
  
/* 全局函数编写 --------------------------------------------------------------*/
/**----------------------------------------------------------------------------
* @FunctionName  : LED()     
* @Description   : None 
* @Data          : 2016/7/10
* @Explain       : None
------------------------------------------------------------------------------*/
unsigned int LED_Main(void)		
{   
	 static u8 _led_cnt = 0;
	
	 LED_Control(_led_cnt);
	 _led_cnt = (_led_cnt + 1)%8; 
	 return 0;																	
}		
 				
						
						
Type_AppList App_LED = {LED_Main,NULL,NULL,NULL, \
						OS_STATE_ACTIVE_ON,OS_THREAD_SYSTEM, \
						(u8*)"LED",100};			
																
				
void LED_Control(u8 num)
{	
	 switch(num)
	 {
		 case 0: LED1 = 0; LED2 = 1;LED3 = 1;LED4 = 1;break;
		 case 1: LED1 = 1; LED2 = 0;LED3 = 1;LED4 = 1;break;
		 case 2: LED1 = 1; LED2 = 1;LED3 = 0;LED4 = 1;break;
		 case 3: LED1 = 1; LED2 = 1;LED3 = 1;LED4 = 0;break;
//		 case 4: LED1 = 1; LED2 = 1;LED3 = 1;LED4 = 1;break;
		 default :  LED1 = 1; LED2 = 1;LED3 = 1;LED4 = 1;break;
	 }
	
}	
/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/





