

/* 头文件包含 ----------------------------------------------------------------*/
#include "Drive_Interrupt.h"

int Balance_Pwm,Velocity_Pwm,Turn_Pwm;
/* 私有宏定义 ----------------------------------------------------------------*/

/* 私有（静态）函数声明 ------------------------------------------------------*/

/* 全局变量定义 --------------------------------------------------------------*/
u8 a;
u8 ia=0,myqwe,change_flag=0;

/* 全局函数编写 --------------------------------------------------------------*/
/**----------------------------------------------------------------------------
* @FunctionName  : TIM2_IRQHandler()
* @Description   : 定时器服务函数
* @Data          : 2016/8/8
* @Explain       : 用于时钟 
-------------------------------------------------------------------------------
None
------------------------------------------------------------------------------*/ 
void TIM2_IRQHandler(void)   
{ 
	TIM_ClearITPendingBit(TIM2,TIM_IT_Update);  //清除TIMx更新中断标志 	
	OS_Clock ++;
}



/**----------------------------------------------------------------------------
* @FunctionName  : TIM3_IRQHandler()
* @Description   : 定时器服务函数
* @Data          : 2016/8/8
* @Explain       : 用于系统线程 
-------------------------------------------------------------------------------
None
------------------------------------------------------------------------------*/ 
void TIM3_IRQHandler(void)   
{ 
	TIM_ClearITPendingBit(TIM3,TIM_IT_Update);  //清除TIMx更新中断标志 	 
	OSThread_4();
}


/**----------------------------------------------------------------------------
* @FunctionName  : TIM4_IRQHandler()
* @Description   : 定时器服务函数
* @Data          : 2016/8/8
* @Explain       : 用于主线程 
-------------------------------------------------------------------------------
None
------------------------------------------------------------------------------*/
void TIM4_IRQHandler(void)
{ 
	TIM_ClearITPendingBit(TIM4,TIM_IT_Update);  //清除TIMx更新中断标志
	OSThread_6(); 
}

/**----------------------------------------------------------------------------
* @FunctionName  : EXTI15_10_IRQHandler()
* @Description   : 外部中断服务函数
* @Data          : 2016/8/8
* @Explain       : 用于接收信息
------------------------------------------------------------------------------- 
None
------------------------------------------------------------------------------*/
void EXTI9_5_IRQHandler(void)
{  
	if(EXTI_GetITStatus(EXTI_Line5) == SET)
	{
	   Get_Angle(1);
	   Blance_GetData_Flag=1;
	   EXTI_ClearITPendingBit(EXTI_Line5); //清除LINE11上的中断标志位   
	}	
}


/*DMA中断函数*/
void DMA1_Channel1_IRQHandler()
{	 
  	u16 i = 0,j = 0; 
	
	if(SmallCar.Channel_Flag == 0)//转移数据
	{
		for(i = 0;i<8;i++)
			for(j = 0;j<5;j++)
		{
			SmallCar.Channel[i][j] = AD_Value[j][i]; 
		}

		SmallCar.Channel_Flag = 1;
	}
		 
	DMA_ClearITPendingBit(DMA1_IT_GL1);
}

/*******************************(C) COPYRIGHT 2016 Vitamin（郭郭）*********************************/











