/*******************************(C) COPYRIGHT 2016 Vitamin（郭郭）*********************************/
/**============================================================================
* @FileName    : Drive_GPIO.h
* @Description : None	
* @Date        : 2016/8/7

*=============================================================================*/ 

/* 防止重调用 ----------------------------------------------------------------*/
#ifndef __DRIVE_GPIO_H
#define __DRIVE_GPIO_H  

/* 头文件包含 ----------------------------------------------------------------*/  
#include "User_Library.h"  

/* 全局宏定义 ----------------------------------------------------------------*/ 

#define     KEY 	PBin(6)
#define      D0		PCin(0)
#define      D1		PCin(1)
#define      D2     PCin(2)
#define      D3		PCin(3)
#define      D4		PAin(1)
#define      D5 	PAin(4)
#define      D6 	PAin(5)
#define      D7 	PAin(0)
/* 结构体声明 ----------------------------------------------------------------*/ 

/* 全局变量声明 --------------------------------------------------------------*/ 

/* 全局函数声明 --------------------------------------------------------------*/  
void GPIO_Test_Init(void); 
void GPIO_Relay_Init(void);
void GPIO_Key_Init(void);
void GPIO_Tracking_Init(void);
	

#endif
/*******************************(C) COPYRIGHT 2016 Vitamin（郭郭）*********************************/



