/*******************************(C) COPYRIGHT 2017 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : main.c
* @Description : None	
* @Date        : 2017/2/16
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.15 (STM32F407ZG)
* @Explain     : None
*=============================================================================*/ 

/* 头文件包含 ----------------------------------------------------------------*/ 
#include "User_Include.h" 

/* 私有宏定义 ----------------------------------------------------------------*/ 
			
/* 私有（静态）函数声明 -------------------------------------------------------*/ 
static void Init(void);

/* 全局变量定义 --------------------------------------------------------------*/ 
			
/* 全局函数编写 --------------------------------------------------------------*/ 
/**---------------------------------------------------------------------------- 
* @FunctionName  : main()     			
* @Description   : None 		
* @Data          : 2016/3/15		
* @Explain       : None			
------------------------------------------------------------------------------*/ 	
int main()					
{		  
	Init();  
	OS_Start();//注册应用App
	
}			
	
	
static void Init(void)
{
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);//8级抢占先级 2级响应优先级   
	
	delay_init(168);	    //初始化延时函数  	
	uart_init(115200);		//初始化串口波特率为115200 
	TFTLCD_Init();			//LCD初始化   
	TP_Init();				//初始化触摸屏 
//	FSMC_SRAM_Init(); 
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_CRC,ENABLE);//开启CRC时钟,为了让emWin检测是否为STM32的芯片 
	
	
	
}	

	

	
/*******************************(C) COPYRIGHT 2017 Wind（谢玉伸）*********************************/
















