/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : Drive_Bootload.h
* @Description : 启动文件
* @Date        : 2016/10/9
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.20 (STM32F103RCT6)
* @Explain     : None
*=============================================================================*/

/* 防止重调用 ----------------------------------------------------------------*/
#ifndef __DRIVE_BOOTLOAD_H
#define __DRIVE_BOOTLOAD_H  

/* 头文件包含 ----------------------------------------------------------------*/  
#include "User_Library.h"  

/* 全局宏定义 ----------------------------------------------------------------*/ 
typedef void(Type_Void)(void); //App 函数定义必须是 void XXX(void) 

/* 结构体声明 ----------------------------------------------------------------*/ 
typedef struct 
{  		  
	Type_Void *New_Addr;//要运行的新程序地址 
	Type_Void *Old_Addr;//要运行的老程序地址 
	unsigned char Flag_Update;//更新标志
	 
	 
}Type_Bootload;  	
				
	
/* 全局变量声明 --------------------------------------------------------------*/ 
extern Type_Bootload Bootload;

/* 全局函数声明 --------------------------------------------------------------*/   
void Bootload_Run(void);
	

#endif
/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/





