/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : Drive_Bootload.c
* @Description : 引导文件
* @Date        : 2016/10/9
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.20 (STM32F103RCT6)
* @Explain     : 
-------------------------------------------------------------------------------
10k(0x8000000 ~ 0x8002800)存放引导文件
1K(0x8002800~0x8003000)存放引导数据
*=============================================================================*/
/* 头文件包含 ----------------------------------------------------------------*/
#include "Drive_Bootload.h"

/* 私有宏定义 ----------------------------------------------------------------*/

/* 私有（静态）函数声明 ------------------------------------------------------*/
static void Bootload_Init(void);
static void Bootload_Update(void);

/* 全局变量定义 --------------------------------------------------------------*/
Type_Bootload Bootload = {0};

/* 全局函数编写 --------------------------------------------------------------*/
/**----------------------------------------------------------------------------
* @FunctionName  : Bootload_Init()
* @Description   : 引导函数初始化
* @Data          : 2016/10/9
* @Explain       : 
-------------------------------------------------------------------------------
现在只是模拟，以后会根据实际得到的数据初始化参数
------------------------------------------------------------------------------*/ 
static void Bootload_Init(void)
{
	Bootload.Flag_Update = 0;//没有跟新标志(实际操作时应当读取Flash的值)
	Bootload.New_Addr = (Type_Void *)(0x8003000|0x01);
	Bootload.Old_Addr = NULL;//要程序的程序的地址
	
}

/**----------------------------------------------------------------------------
* @FunctionName  : Bootload_Update()
* @Description   : 升级函数
* @Data          : 2016/10/10 
* @Explain       : 
-------------------------------------------------------------------------------
None
------------------------------------------------------------------------------*/ 
static void Bootload_Update(void)
{
	if(Bootload.Flag_Update)
	{
		Bootload.Flag_Update = 0;//(实际操作时应当写入Flash)
		Bootload.Old_Addr = Bootload.New_Addr;//转移原来程序的地址(实际操作时应当写入Flash)
		Bootload.New_Addr = (Type_Void *)(0x8003000|0x01);//(实际操作时应当读取Flash的值) 
		
		NVIC_SystemReset();//重启 
		
	}
}

 
/**----------------------------------------------------------------------------
* @FunctionName  : Bootload_Run()
* @Description   : 引导函数运行
* @Data          : 2016/10/9
* @Explain       : 
-------------------------------------------------------------------------------
None
------------------------------------------------------------------------------*/ 
void Bootload_Run(void)
{ 
	while(1)
	{
		Bootload_Init(); 							
		Bootload_Update();							
		Bootload.New_Addr();//跳转至运行的程序		
		
	}
	
}
 




/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/












