/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : Drive_AD9851.h
* @Description : None
* @Date        : 2016/7/20
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.15 (STM32F407ZG)
* @Explain     : None
*=============================================================================*/

/* 防止重调用 ----------------------------------------------------------------*/
#ifndef __DRIVE_AD9851_H
#define __DRIVE_AD9851_H 

/* 头文件包含 ----------------------------------------------------------------*/  
#include "User_Library.h"  
#include "OS_StartFile.h"

/* 全局宏定义 ----------------------------------------------------------------*/   

/* AD9851 控制引脚 -----------------------------------------*/			
#define AD9851_RESET  GPIOC_OUT(11)// 复位键，低电平复位
#define AD9851_FQUD	  GPIOC_OUT(12)	// 频率更新控制信号，上升沿有效
#define AD9851_WCLK	  GPIOC_OUT(10) // 控制字转入信号，上升沿有效
#define AD9851_Data	  GPIOG->ODR 	// 输出PC.0~PC.7 

/* 结构体声明 ----------------------------------------------------------------*/ 

/* 全局变量声明 --------------------------------------------------------------*/ 

/* 全局函数声明 --------------------------------------------------------------*/   
void AD9851_Init(void);
void AD9851_Set(double F,uint8_t Phase);
void AD9851_FM(double Vol);

#endif
/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/



