/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : Drive_Exti.h
* @Description : None
* @Date        : 2016/3/15
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.15 (STM32F407ZG)
* @Explain     : None
*=============================================================================*/

/* 防止重调用 ----------------------------------------------------------------*/
#ifndef __DRIVE_EXTI_H
#define __DRIVE_EXTI_H 

/* 头文件包含 ----------------------------------------------------------------*/  
#include "User_Library.h" 

/* 全局宏定义 ----------------------------------------------------------------*/

/* 结构体声明 ----------------------------------------------------------------*/ 

/* 全局变量声明 --------------------------------------------------------------*/ 

/* 全局函数声明 --------------------------------------------------------------*/  
void Exti0_Init(void);
void Exti1_Init(void);
void Exti2_Init(void);
void Exti3_Init(void);
void Exti4_Init(void);
void Exti10_Init(void);

void Exti_Enable(u8 Exti_Num);	
void Exti_Disable(u8 Exti_Num);

#endif
/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/



