/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : App_PS2.h
* @Description : PS2键盘
* @Date        : 2016/7/16
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.15 (STM32F407ZG)
* @Explain     : None
*=============================================================================*/
							
/* 防止重调用 ----------------------------------------------------------------*/
#ifndef __APP_PS2_H
#define __APP_PS2_H 

/* 头文件包含 ----------------------------------------------------------------*/  
#include "OS_StartFile.h"

/* 全局宏定义 ----------------------------------------------------------------*/
#define PS2_STATE_FREE  	0
#define PS2_STATE_INPUT  	1

#define PS2_NUM_INVALID  	0xff

#define KEY_POSI_MAX		(5-1)

/* 结构体声明 ----------------------------------------------------------------*/ 
typedef struct
{
	u8 		Now;
	double	Result;
	u8 		State;
	u8 		UpData;
	u8 		Select;//选项控制
	int 	Posi;//位置控制	
}Type_PS2;

/* 全局变量声明 --------------------------------------------------------------*/  
extern Type_PS2 PS2;

/* 全局函数声明 --------------------------------------------------------------*/  				
extern Type_AppList App_PS2;
 
 
 
 
 
 
 
#endif
/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/



