/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : App_PhaseShift.c
* @Description : 移相
* @Date        : 2016/7/29
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.20 (STM32F407ZG)
* @Explain     : None
*=============================================================================*/
/* 头文件包含 ----------------------------------------------------------------*/ 
#include "App_PhaseShift.h"  
 
/* 私有宏定义 ----------------------------------------------------------------*/ 

/* 私有（静态）函数声明 ------------------------------------------------------*/   

/* 全局变量定义 --------------------------------------------------------------*/  

/* 全局变量声明 --------------------------------------------------------------*/
  
/* 全局函数编写 --------------------------------------------------------------*/
/**----------------------------------------------------------------------------
* @FunctionName  : PhaseShift()     
* @Description   : 移相
* @Data          : 2016/7/29
* @Explain       : 
-------------------------------------------------------------------------------
* None
------------------------------------------------------------------------------*/
unsigned int PhaseShift_Main(void)		
{  	 
	if(PS2.UpData == 1) 
	{
		PS2.UpData = 0;
		Phase_Shift(PS2.Result);
	} 
	 
	return 0;																	
}		
	
unsigned int PhaseShift_Start(void)		
{
	static u8 first = 0;
	if(first == 0)
	{ 
		first = 1; 
		x9421_Init();  
		Phase_Shift(0); 
		OSTask_Creat(&App_PS2);  
	}   
	return 0;
} 
Type_AppList App_PhaseShift = 	{PhaseShift_Main,NULL,PhaseShift_Start,NULL, \
								OS_STATE_ACTIVE,OS_THREAD_PRIMARY, \
								(u8*)"VoltageGai",200};	
						
								
/**----------------------------------------------------------------------------
* @FunctionName  : Phase_Shift()     
* @Description   : 移相控制
* @Data          : 2016/7/29
* @Explain       :
-------------------------------------------------------------------------------
_degree： 0~359
------------------------------------------------------------------------------*/ 			
void Phase_Shift(u16 _degree)
{
	if(_degree <90 ){Relay2 = 0;Relay1 = 0;}
	else if(_degree <180){Relay2 = 0;Relay1 = 1;_degree -=90;}
	else if(_degree <270){Relay2 = 1;Relay1 = 0;_degree -=180;}
	else if(_degree <360){Relay2 = 1;Relay1 = 1;_degree -=270;}
	else return; 
	x9421_Control(_degree*255/90);   
}

 
 
						
/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/




								
								
								

